{"meta":{"title":"ch206265 Blog","subtitle":null,"description":null,"author":"ch206265","url":"http://yoursite.com","root":"/"},"pages":[{"title":"关于","date":"2019-06-04T13:39:41.000Z","updated":"2019-06-05T00:15:01.558Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":""},{"title":"分类","date":"2019-06-04T13:39:04.000Z","updated":"2019-06-05T00:16:29.151Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2019-05-31T07:05:01.000Z","updated":"2019-06-05T00:19:11.511Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"标签","date":"2019-06-04T13:39:29.000Z","updated":"2019-06-05T00:17:27.369Z","comments":true,"path":"tags/index-1.html","permalink":"http://yoursite.com/tags/index-1.html","excerpt":"","text":""}],"posts":[{"title":"从傅里叶变换到小波变换","slug":"从傅里叶变换到小波变换","date":"2019-06-05T12:22:15.000Z","updated":"2019-06-06T14:46:16.810Z","comments":true,"path":"2019/06/05/从傅里叶变换到小波变换/","link":"","permalink":"http://yoursite.com/2019/06/05/从傅里叶变换到小波变换/","excerpt":"","text":"一般称在时间域内的离散数字信号为原始信号。大多数的信号都是这种基于时间的函数，其对应的图形也就是关于“时间-幅值”的图形。但是，仅有这一种描述形式还远远不够，因为信号的一些重要特征在时间域内并不能够有明显的体现。 如果想要在其他的变换域内表示信号，就必须对信号施加各种数学变换，傅里叶变换/小波变换等都是其中的一种。而任何经过某种数学变换的输出信号则被称为处理信号。 傅里叶变换FT傅里叶变换主要是将信号从时间域转换到频率域，信号的一些在时间域内表现的不明显的特征在频率域内会更加明显，更有利于对信号的分析。此外，傅里叶变换（包括小波变换）是一种可逆的数学变换，即它不仅能够将时间域内的信号转换到频率域（频率-幅值），还可以把频率域的信号转换回时间域（时间-幅值）。 但是，对于傅里叶变换在任何给定的时间，人们只能看到时间-幅值和频率-幅值二者之间的一种变化波形。也就是说： 观察时间域信号波形，看不出信号中的频率信息，只能看到信号的全部频率信息经过积分平均后所反映的信号在时刻t的值（可参考傅里叶逆变换公式$f(t)=\\int_{-\\infty}^{+\\infty} \\hat{f}(\\omega) \\mathrm{e}^{\\mathrm{i} 2 \\pi \\omega t} \\mathrm{d} \\omega$） 分析频率域（傅里叶变换域）信号的频谱波形则缺少时间信息，即，信号在某一频率处的值是全部时间域的信号值经过积分平均形成（可参考傅里叶变换公式$\\hat{f}(\\omega)=\\int_{-\\infty}^{+\\infty} f(t) \\mathrm{e}^{-\\mathrm{i} 2 \\pi \\omega t} \\mathrm{d} t$） 再次回顾一下傅里叶变换，它是将时间域的信号转换到了频率域，给出了信号的频谱，描述的是信号的“频率-幅值”波形。通过振幅值可以判断信号中存在多少频率成分（对应振幅值为0的频率成分不存在），发现信号在时间域中发现不了的特征。但是，傅里叶变换并没有告诉我们何种频率成分出现在何时。那么是不是在分析所有信号的时候都需要知道“何种频率成分出现在何时”呢？ 首先，平稳信号。在时间域中，我们称频率成分不随时间变化的信号为平稳信号。对于平稳信号，人们不需要知道其某一频率成分在什么时候出现。因为它的所有频率成分不随时间变化，在所有时刻都是一样的，也即平稳信号的所有频率成分在所有时刻出现。但是，对于非平稳信号，它的频率成分是随时间变化的，人们需要分析其频率和时间的关系也就需要同时知道它的时间和频率信息。这样，使用傅里叶变换分析非平稳信号就不太合适了。 短时傅里叶变换STFT非平稳信号在任一较短的时间间隔内可以近似认为是平稳信号，由此可以想象如果将非平稳信号切分成较短的时间区间，或用一个窗口长度较小的限制函数对原始非平稳信号加以限制，就可以形成一个近似的局部平稳信号，然后就可以在局部使用傅里叶变换进行分析。 这种通过取较短时间间隔或者加窗进行傅里叶变换的方法称为短时傅里叶变换（short time Fourier transform,STFT）又叫做窗口傅里叶变换(windowed Fourier transform,WFT)。所以，信号的短时傅里叶变换不是别的，正是这个信号和窗口函数相乘后的傅里叶变换。 S T F T_{f}(b, \\omega)=\\int_{-\\infty}^{+\\infty}[f(t) g(t-b)] \\cdot \\mathrm{e}^{-\\mathrm{i} 2 \\pi \\omega t} \\mathrm{d} t但是，短时傅里叶变换也具有局限性，且与其窗口函数有关。海森伯测不准原理说明，窗口函数的分辨率单元不可能在时间维和频率维同时达到无限小，即不可能得到信号的时频精确表示，也就是说，人们不可能知道哪一频率成分发生在哪一精确时刻，只能够知道某一披绿范围（即频带）发生在哪个时间间隔。 为了满足平稳性的假设，就必须有足够短的窗口函数，在这个较短的时间间隔内，信号才可以近似认为是平稳的。但是，窗口函数的时间域支撑越短，越适合平稳性假设，也就能获得越好的时间粉笔那缕，但是频率分辨率就越差；而宽的窗口给出了较好的频率分辨率但是时间分辨率变差，并且较宽的窗口也不满足平稳性要求。所以窗口函数的选择问题突出体现了短时傅里叶的变换的局限性 一般来说，实验中观测道德信号，其特定频率成分事先是不知道的，因此，利用短时傅里叶变换对信号进行有效分解时，也不能保证选择到恰当的窗口大小尺寸。 为了解决分析处理非平稳信号时遇到的这种分辨率选择，也即分析确定窗口函数宽度的问题，研究人员需要寻找其他更适合的技术，小波变换就是其中之一。 一个短时傅里叶变换的例子信号$f(t)$的表达式如下： f(t)=\\left\\{\\begin{array}{ll}{\\sin 2 \\pi \\cdot 300 t,} & {t \\in[0,250]} \\\\ {\\sin 2 \\pi \\cdot 200 t,} & {t \\in[250,500]} \\\\ {\\sin 2 \\pi \\cdot 100 t,} & {t \\in[500,750]} \\\\ {\\sin 2 \\pi \\cdot 50 t,} & {t \\in[750,1000]}\\end{array}\\right.很明显它是一个非平稳信号，并且它的时间域图像如下： 下图是该信号在在不同窗口下进行短时傅里叶变换的三维图： 从这三组图中可以看出 (a)图的窗口函数最窄，时间分辨率最高（时间轴上对应的窗口宽度最窄），但是频率分辨率较差（频率轴上对应的窗口宽度最宽） (b)和(c)图的窗口函数宽度逐渐变大，时间轴上对应的每一个分析窗口也越来越大，但是相应的，在频率轴上对应的分析窗口的宽度却越来越窄 这说明了短时傅里叶变换的窗口分辨率所潜在的问题，即，窗口函数的分辨率不能在时间维和频率维上同时达到最大。 小波变换WT小波变换的定义如下： W T_{f}(a, \\tau)=\\frac{1}{\\sqrt{a}} \\int_{R} f(t) \\psi^{*}\\left(\\frac{t-\\tau}{a}\\right) d t 其中$\\tau$代表平移参数，它表示尺度化后的基本小波沿时间轴移动的中心位置 $a&gt;0$，表示尺度参数，大的尺度对应着信号大范围内的整体概貌，对应较粗的观测；小的尺度则对应局部细节的观测 在短时傅里叶变换中，一旦选定了窗口函数，那么它就有了确定的窗口宽度或支撑。这样，短时傅里叶变换就只能用这单一不变的窗口分辨率去分析信号中的所有频率成分。 小波变换是短时傅里叶变换的发展，它能够针对待分析信号不同的频率成分调整窗口函数的宽度，即能够选择不同的分辨率对不同频率成分进行分析。比如： 在分析信号中的低频成分时，采用较低的时间分辨率（即窗口函数具有较大的时间域窗口宽度）。因为低的频率（大的尺度）对应的信号波形在时间域变化较缓而且持续时间长，用较宽的时间窗口就可以区分不同的频率成分。并且，宽的窗口函数对信号低频信息所能观察的范围更大/采集的样本更多，能更好地把握信号的整体性概貌或整体趋势 在分析高频成分时，采用较高的时间分辨率（即窗口具有较小的时间域窗口宽度）。因为高的频率（小的尺度）对应着信号的细节信息，对应的信号波形在时间域变化较快而且持续时间短，用窄窗口函数才可以区分不同的频率成分。并且，宅窗口有利于在时间域准确定位高频成分发生的时刻瞬间，从而预测信号的剧烈变化","categories":[{"name":"图像处理","slug":"图像处理","permalink":"http://yoursite.com/categories/图像处理/"}],"tags":[{"name":"小波变换","slug":"小波变换","permalink":"http://yoursite.com/tags/小波变换/"},{"name":"图形处理","slug":"图形处理","permalink":"http://yoursite.com/tags/图形处理/"}]},{"title":"","slug":"草稿1遥感卫星总结","date":"2019-06-01T06:11:47.457Z","updated":"2019-05-22T00:57:35.189Z","comments":true,"path":"2019/06/01/草稿1遥感卫星总结/","link":"","permalink":"http://yoursite.com/2019/06/01/草稿1遥感卫星总结/","excerpt":"","text":"一、遥感卫星的分类 根据观测对象的不同，遥感卫星主要分为陆地观测卫星、气象观测卫星、海洋观测卫星 按观测对象分类 举例 描述 陆地观测卫星 LandsatSPOTIRSIkonosQuickBirdTERRA 气象观测卫星 GOESNOAA 海洋观测卫星 SeaStar 根据遥感卫星所载传感器工作的不同波段可以分为光学遥感卫星和微波遥感卫星(紫外遥感、可见光遥感、红外遥感、微波遥感、多波段遥感) 按传感器波段分类 举例 描述 光学遥感卫星 Landsat&lt;/br&gt;SPOT&lt;/br&gt;GF-1&lt;/br&gt;GF-2 微波遥感卫星 GF-3(合成孔径雷达成像卫星) 根据遥感卫星的运行轨道不同，又可以分为太阳同步轨道卫星和地球同步轨道卫星 按运行轨道分类 举例 描述 太阳同步轨道卫星 GF-1&lt;/br&gt;GF-2 地球同步轨道卫星&lt;/br&gt;(地球静止轨道) GF-4&lt;/br&gt;风云二号&lt;/br&gt;风云四号 极地轨道卫星 风云一号&lt;/br&gt;风云三号 根据获取遥感数据的方式不同，分为返回型和传输型卫星 按获取数据方式分类 举例 描述 返回型卫星 传输型卫星 按照遥感平台的不同可以分为地面遥感、航空遥感、航天遥感 按遥感平台分类 举例 描述 地面遥感 航空遥感 航天遥感(卫星遥感) 按照遥感探测的工作方式不同，可将遥感分为主动式遥感和被动式遥感 按探测方式分类 举例 描述 主动式遥感(雷达遥感) 由传感器主动地向被探测的目标物发射一定波长的电磁波，然后接受并记录从目标物反射回来的电磁波 被动式遥感 传感器不向被探测的目标物发射电磁波，而是直接接受并记录目标物反射太阳辐射或目标物自身发射的电磁波 补充： 1.1 关于光学遥感随着光谱分辨率的提高，光学遥感卫星的发展过程可以分为：全色遥感卫星-&gt;彩色遥感卫星-&gt;多光谱遥感卫星-&gt;高光谱遥感卫星-&gt;超高光谱遥感卫星==全色波段（Panchromaticband）==，即可见光波段范围。因为是单波段，在图上显示是灰度图片。全色遥感影像一般空间分辨率高，但无法显示地物色彩。实际操作中，我们经常将之与波段影象融合处理，得到既有全色影象的高分辨率，又有多波段影象的彩色信息的影象。全色波段，一般指使用0.5微米到0.75微米左右的单波段，即从绿色往后的可见光波段。全色遥感影象也就是对地物辐射中全色波段的影象摄取，因为是单波段，在图上显示是灰度图片。全色遥感影象一般空间分辨率高，但无法显示地物色彩。==多光谱遥感==：将地物辐射电磁破分割成若干个较窄的光谱段，以摄影或扫描的方式，在同一时间获得同一目标不同波段信息的遥感技术。原理：不同地物有不同的光谱特性，同一地物则具有相同的光谱特性。不同地物在不同波段的辐射能量有差别，取得的不同波段图像上有差别。优点：多光谱遥感不仅可以根据影像的形态和结构的差异判别地物，还可以根据光谱特性的差异判别地物，扩大了遥感的信息量。==高光谱遥感==起源于20世纪70年代初的多光谱遥感，它将成像技术与光谱技术结合在一起，在对目标的空间特征成像的同时，对每个空间像元经过色散形成几十乃至几百个窄波段以进行连续的光谱覆盖，这样形成的遥感数据可以用“图像立方体”来形象的描述。同传统遥感技术相比，其所获取的图像包含丰富的空间、辐射和光谱三重信息。 高光谱遥感具有不同于传统遥感的新特点：1）波段多：可以为每个像元提供十几、数百甚至上千个波段；2）光谱范围窄：波段范围一般小于10nm；3）波段连续：有些传感器可以在350~2500nm的太阳光谱范围内提供几乎连续的地物光谱；4）数据量大：随着波段数的增加，数据量成指数增加；5）信息冗余增加：由于相邻波段高度相关，冗余信息也相对增加。优点：1）有利于利用光谱特征分析来研究地物；2）有利于采用各种光谱匹配模型；3）有利于地物的精细分类与识别； ==比较==：高光谱和多光谱实质上的差别就是：高光谱的波段较多，普带较窄。（Hyperion有233~309个波段，MODIS有36个波段）多光谱相对波段较少。（如ETM+，8个波段，分为红波段，绿波段，蓝波段，可见光，热红外（2个），近红外和全色波段）高光谱遥感就是多比多光谱遥感的光谱分辨率更高，但光谱分辨率高的同时空间分辨率会降低。 1.2 关于微波遥感1.3 光学遥感和微波遥感的比较二、遥感卫星常用的波段有哪些三、遥感卫星常用的传感器类型有哪些 卫星 传感器 描述 Landsat ETM+&lt;/br&gt;MSS&lt;/br&gt;TM SPOT HRS&lt;/br&gt;HRG&lt;/br&gt;VEGETATION GF-1 PMS(全色多光谱相机)&lt;/br&gt;WFV(多光谱相机) 1. 有效载荷配置有 2 台分辨率为 2m全色 /8m多光谱的高分辨率相机和 4 台&lt;/br&gt;分辨率为 16m 的多光谱宽幅相机，从而在同一颗卫星上实现了&lt;/br&gt;高分辨率和830Km宽幅的成像能力，&lt;/br&gt;2. 一帧画面即可覆盖64000平方千米范围的地表，相当于北京市面积的4倍！&lt;/br&gt;3. 其还具有多载荷图像拼接融合技术 GF-2 PMS(全色多光谱相机)&lt;/br&gt; 装有两 台 1m分辨率全色 /4m分辨率多光谱、幅宽 26km的对地 成像相机，&lt;/br&gt;通过拼接可实现 45km大幅宽图像 GF-4 GF-5 大气环境红外甚高光谱分辨率探测仪&lt;/br&gt;全谱段光谱成像仪&lt;/br&gt;大气气溶胶多角度偏振探测仪&lt;/br&gt;大气主要温室气体检测仪&lt;/br&gt;可见短波红外高光谱相机&lt;/br&gt;大气痕量气体差分吸收光谱仪 四、卫星分辨率总的包括空间分辨率、时间分辨率和光谱分辨率 分辨率 描述 影响因素 空间分辨率 光学成像卫星的空间分辨率 光学遥感卫星的空间分辨率是指从光学成像卫星所拍摄的照片上辨别地面目标额最小尺寸 光学成像卫星的空间分辨率与卫星轨道高度和相机焦距有关，高度越高，焦距越小，空间分辨率就越低 雷达成像卫星的空间分辨率 1. 与光学成像卫星有所不同，它指雷达图像上能够区分开的地面两个不同目标的最小距离;2. 具体有方位分辨率、距离分辨率和面分辨率三种参数。其中， 面分辨率是方位分辨率和距离分辨率的乘积，表示地面分辨单元的大小 1. 雷达成像卫星的分辨率与卫星的运动方向有关，通常用区分同一运动方向上相邻两个目标的能力来表示2. 提高分辨率的方式主要有两种：一是采用短波长；二是增加天线口径 时间分辨率 重复观测同一区域所需要的时间，对于动态观测统一区域十分重要 时间分辨率和空间分辨率是一对冤家，卫星运行轨道高覆盖面大，时间分辨率就高，但是空间分辨率就小； 1. 一般来讲，用于普查的对地观测卫星的轨道高度和时间分辨率都比较高，但是空间分辨率较小； 2. 但是，用于详查的对地观测卫星的轨道高度和时间分辨率都比较小，但是空间分辨率高 光谱分辨率","categories":[],"tags":[]},{"title":"","slug":"草稿4各种雷达","date":"2019-05-31T05:10:31.042Z","updated":"2019-04-24T08:43:26.166Z","comments":true,"path":"2019/05/31/草稿4各种雷达/","link":"","permalink":"http://yoursite.com/2019/05/31/草稿4各种雷达/","excerpt":"","text":"一、概念主要区分一下Lidar/SAR/InSAR/D-InSAR/RAR/PolSAR 1.1. Radar 雷达，是英文Radar的音译，源于radio detection and ranging的缩写，意思为”无线电探测和测距”； 即用无线电的方法发现目标并测定它们的空间位置。因此，雷达也被称为“无线电定位”，是利用电磁波探测目标的电子设备； 雷达发射电磁波对目标进行照射并接收其回波，由此获得目标至电磁波发射点的距离、距离变化率（径向速度）、方位、高度等信息。 1.2. Lidar LiDAR——Light Detection And Ranging，即激光探测与测量，也就是激光雷达； 利用GPS（Global Position System）和IMU（Inertial Measurement Unit，惯性测量装置）的机载激光扫描，其所测得的数据为数字表面模型(Digital Surface Model, DSM)的离散点表示，数据中含有空间三维信息和激光强度信息； 应用分类(Classification)技术在这些原始数字表面模型中移除建筑物、人造物、覆盖植物等测点，即可获得数字高程模型(Digital Elevation Model, DEM)，并同时得到地面覆盖物的高度。 1.3. RAR1.4. SAR 合成孔径雷达（简称SAR）是一种主动式的对地观测系统； 可安装在飞机、卫星、宇宙飞船等飞行平台上，全天时、全天候对地实施观测、并具有一定的地表穿透能力； SAR系统在灾害监测、环境监测、海洋监测、资源勘查、农作物估产、测绘和军事等方面的应用上具有独特的优势，可发挥其他遥感手段难以发挥的作用，因此越来越受到世界各国的重视 1.5. InSAR 干涉雷达指采用干涉测量技术的合成孔径雷达（Interferometric Synthetic Aperture Radar,InSAR），是传统的SAR遥感技术与射电天文干涉技术相结合的产物； 它利用雷达向目标区域发射微波，然后接收目标反射的回波，得到同一目标区域成像的SAR复图像对； 若复图像对之间存在相干条件，SAR复图像对共轭相乘可以得到干涉图，根据干涉图的相位值，得出两次成像中微波的路程差，从而计算出目标地区的地形、地貌以及表面的微小变化，可用于数字高程模型建立、地壳形变探测等。 1.6. D-InSAR 合成孔径雷达差分干涉测量技术（Differential InSAR, DInSAR），它是利用同一地区不同时相的SAR影像，通过差分干涉，获取该地区地表形变信息的技术手段； 已有研究提出了三种方法进行差分干涉，两轨法、三轨法和四轨法； 1.7. PolSAR 极化干涉合成孔径雷达（Polarimetric Synthetic Aperture Radar Interferometry）是极化SAR与干涉SAR的结合，充分利用了干涉观测量(相干性和干涉相位)随极化变化的特性； 既具有干涉SAR获取目标高程的能力，又具有极化SAR对不同散射机理的分辨能力，还具有提高干涉SAR相干性的能力以及提取体散射体(如森林，农作物，冰雪等)参数的潜力。 1.8. PSInSAR PSInSAR技术是“永久散射体合成孔径雷达干涉测量”的多重嵌套缩写，即Persistent Scatterer Interferometric Synthetic Aperture Radar。 二、区分2.1 LiDAR和SAR LiDAR其实是激光测距,是通过对从空中或空间飞行器上发射的激光角度和探测到的激光距离来解算激光点的地面坐标的方法,LiDAR是点测量.LiDAR是直接测量.SAR是合成孔径雷达,是用小孔径天线通过运动和数学计算而达到大孔径雷达的测量效果的技术.sar是需要通过对多个位置的雷达信号的联合数值计算来获得结果的,sar是间接测量. SAR是合成孔径雷达,数据记录的是雷达后向散射的强度.LiDAR是激光雷达,数据记录的是激光往返的时间和强度.","categories":[],"tags":[]}]}