{"meta":{"title":"ch206265 BLOG","subtitle":null,"description":null,"author":"ch206265","url":"http://ch206265.github.io","root":"/"},"pages":[{"title":"关于","date":"2019-06-04T13:39:41.000Z","updated":"2019-06-05T00:15:01.558Z","comments":true,"path":"about/index.html","permalink":"http://ch206265.github.io/about/index.html","excerpt":"","text":""},{"title":"分类","date":"2019-06-04T13:39:04.000Z","updated":"2019-06-05T00:16:29.151Z","comments":true,"path":"categories/index.html","permalink":"http://ch206265.github.io/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2019-06-04T13:39:29.000Z","updated":"2019-06-05T00:17:27.369Z","comments":true,"path":"tags/index-1.html","permalink":"http://ch206265.github.io/tags/index-1.html","excerpt":"","text":""},{"title":"标签","date":"2019-05-31T07:05:01.000Z","updated":"2019-06-05T00:19:11.511Z","comments":false,"path":"tags/index.html","permalink":"http://ch206265.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"使用AI获取图像光滑的图形轮廓","slug":"使用AI获取位图图像光滑的图形轮廓","date":"2019-06-12T09:03:16.000Z","updated":"2019-06-12T10:09:58.366Z","comments":true,"path":"2019/06/12/使用AI获取位图图像光滑的图形轮廓/","link":"","permalink":"http://ch206265.github.io/2019/06/12/使用AI获取位图图像光滑的图形轮廓/","excerpt":"","text":"最近需要将一些地图资源符号化，以便在地图上显示。 在阿里巴巴矢量图标库)中能找到大部分比较满意的基础图元符号，然后按找自己的设计思路进行修改，尤其是当需要找一些知名的APP图标时，它们的矢量logo大部分都可以找到。但是也有一些找不到，比如我想在地图上表示水木清华论坛，需要寻找它的logo作为在地图上显示的符号（logo背景统一填充为白色）。 在网络上，我只找到了一个比较模糊的水木论坛的jpg图片，并且图片中除了图形符号外，还有一些文字，但是我只需要上面的图形符号。此外，我不会使用上面的钢笔工具，没有办法描边，只能借助于AI 或者PS看看有没有比较傻瓜一点的方式。下面就此总结一下。 PS的快速选择工具快速选择工具可以快速把相似颜色的区域选择出来，能够选出符号的轮廓，但是因为位图符号，都是一些锯齿状的边缘，勾选的边缘不够平滑，效果不好。如果将图像放大，局部修改蚂蚁线，不仅比较费时费力，而且效果也不好，没有办法保证平滑。 Illustrated的图像描摹工具将jpg图像导入到AI中，使用图像描摹——高保真度/低保真度照片/…——扩展 经过这三步，大致就能将图片中图形的轮廓勾选出来，效果比PS的快速选择工具要好，但是总体来讲还是有很多地方可以修改。 右键图像——取消编组，这样就可以分离整张图片上的图形轮廓和文字轮廓，删除不感兴趣的文字轮廓； 使用剪刀工具修剪一些比较大的轮廓偏差，然后使用橡皮擦工具对局部的不够光滑的边缘做一下处理； 然后将背景填充为白色，之后导出为PNG(应该是位图的格式都可以)； 在此把导出的图像导进AI中，重复上面的操作，效果就会越来越好了 效果如下：","categories":[{"name":"可视化","slug":"可视化","permalink":"http://ch206265.github.io/categories/可视化/"}],"tags":[{"name":"符号设计","slug":"符号设计","permalink":"http://ch206265.github.io/tags/符号设计/"},{"name":"Illustrated","slug":"Illustrated","permalink":"http://ch206265.github.io/tags/Illustrated/"}]},{"title":"思而不学则殆","slug":"思而不学则殆","date":"2019-06-08T14:07:42.000Z","updated":"2019-06-08T16:27:03.659Z","comments":true,"path":"2019/06/08/思而不学则殆/","link":"","permalink":"http://ch206265.github.io/2019/06/08/思而不学则殆/","excerpt":"","text":"为什么今天要写这个呢？其实在接触到博客之前，自己一直使用云笔记，也经常在云笔记里面写一些思考和反思。说“经常”其实也不太对，毕竟在自己目标明确或者“一帆风顺”的时候，根本不会想起来写一些反思，往往都会是在心情或者学习状态比较起伏，目标不明确，总之生活有些混乱的时候才会去写。所以，今天写这个东西，的确是最近感觉遇到了些小问题，需要用文字理一理。 之前的一些事上学期研一刚开学，自己心中冲劲十足，想要按照自己的计划来弥补一下大学本科四年来的遗憾。不管计划以及实施如何，总之目标就是，研究生毕业时自己要有拿得出手的东西，更准确地说，自己不要当个水货。但是刚一开学，我就始料未及的成为了班长，成为班长之路真的是像设计好的剧本一样巧，真的是无巧不成书，但是这是现实啊！其实如果像大学那样，研究生生涯当个班长锻炼一下也没什么，但是由于学校的原因，在这里当班长就相当于在大学当辅导员一般，尤其是他们对于班长的使唤简直像一个全职秘书一样，对于大学四年一直透明的我，这相当于一上来就遇到了地狱模式的“锻炼”。当时上半学期，我也真是被班级后勤事务，导师，课程以及自己的计划四重大山紧紧压迫，时间严重不足。以我的性格，辞职这个念头一直纠结到学期末，期间也遇到课题任务和自己计划的不一样的困扰。就这样，我的研一上学期结束了，我想要“培养能拿出手的东西”的计划，似乎也一直郁结在心中没有什么进展。 现在不管过程怎么样，在研一下学期刚开学的时候，我终于把班长辞了。导师那边，我也基本默认接受了这个之前不怎么了解的方向。不过当时因为感觉没有转机，我也一直在思考怎么把课任务与自己毕业之后的就业关系起来。就在刚刚有些眉目的情况下，导师又接了新的项目，还和之前自己比较感兴趣的领域有点关系，但是老师学生比较少，正在愁没人做（我们课题组基本每个人的方向都不一样，一人跟一个项目，大师兄更是几乎垮了所有项目带我们），我就主动请缨了。所以，后来……两个课题任务都在做，一段时间内哪个任务比较紧急就做哪个。当时真的在想，为什么自己这么菜，如果自己的能力在本科四年有所磨练，那么现在应该就是大展身手的时候了，哈哈，其实导师对我们都很好，在课题组机会也会比较多但是无奈自己太菜了😔。 目前，随着课程慢慢结束，班长职务的辞职，自己能掌控的时间的确变多了，尤其是没有当班长时来自他们的小骚扰，学习也更加专注了。但是，当外界条件慢慢变好之时，自己的心境却发生了些变化。 其实科研也并没有自己想象中的那样简单，并且由于导师带学生的方式，我们大多都是自己在科研的道路上摸索（其实自己主动的交流也比较少），至少我感觉自己目前还没有跨入科研的大门。再加上现在已经到了学期末，各种课程作业袭来，慢慢的，时间又转移到了课程作业上。自己心心念念的科研，或者培养“能拿得出手的东西”的计划又有点停滞了…… 所以，此时，我好像突然想起来我还有个计划，计划着自己的研究生生涯不要像大学那样什么都没有学到，计划着研究生毕业的时候有能拿得出手的东西。周围的同学都在慢慢的成长，他们似乎都正在形成自己能拿得出手的东西（我又拿别人比较了）。其实我知道尽量不要拿别人比较，做好自己便是，但是，这种比较更像是“见贤思齐”，因为自己本身实在“问心有愧”，没法说服自己不去比较。其实我也发现了，当自己越是心里没底，越是没有目标的时候越喜欢和其他人比较，呵，这个时候比较，结果就是我现在再写这个东西…… 对此，之前是怎么想的之前是咋想的：要有拿得出手的东西。这句话是大一的时候，社团学姐告诉我们这些社团萌新的，我记到了现在。结果是大学四年除了成绩单，我感觉也没啥比较实际的东西能拿得出手，而现在，似乎又要走之前的老路了。只记住要有东西能拿得出手，却不知道究竟要把什么拿出来。 关于这个目标，我一直都是在课题中寻找，希望将课题任务和之后自己毕业找工作需要用到的技能结合起。很遗憾，现在这个新的方向，我还没有找到（按道理讲有点不太可能，后注）~~而之前转走的那个自己不太了解的方向反而找到了一些结合点。我也有想过就按照之前找到的哪些结合点深挖掘下去，但是这样，这个自己主动请缨的新项目岂不是成为了累赘？因为这两个方向相差的有点远。但是按照大师兄之前说的，所有课题任务都是要大家一起做，大家都参与，我也就有些释怀，不要分的那么清楚。或许是我太想把课题任务和就业找工作相结合了。但是这怎么说呢，精力毕竟是有限的，能结合当然是好事。 尽管还是比较纠结，但自己现在最需要做的还是尽量清晰一下目标。是在课题中找结合点，还是两者平行着来，需要考虑一下，然后就一直考虑，越考虑越不知道自己该干什么了…… 该怎么办我刚刚审视了一下自己说的话 很遗憾，现在这个新的方向，我还没有找到 讲道理，这有点不太可能…… 我对自己的分析大致如下： 最近突然意识到自己目标和方向不清晰，一不清晰心里就没底，一心里没底就焦虑，接着就是因为焦虑而想的太多，结果越想越想不出结果，越焦虑。 所以，先缓解一下自己的焦虑吧，目前自己是想的太多，做的太少，已经处于“思而不学则殆”了，知识储备太少，眼界太狭窄，也不会有什么好的思考结果。 如果目标不能在行动之前就清晰了，那就在行动中渐渐把他弄明白，关键是不要停下来，不要陷入想太多干太少的局面。加油！干起来！","categories":[{"name":"生活","slug":"生活","permalink":"http://ch206265.github.io/categories/生活/"}],"tags":[{"name":"反思","slug":"反思","permalink":"http://ch206265.github.io/tags/反思/"}]},{"title":"从傅里叶变换到小波变换","slug":"从傅里叶变换到小波变换","date":"2019-06-05T12:22:15.000Z","updated":"2019-06-08T13:17:49.059Z","comments":true,"path":"2019/06/05/从傅里叶变换到小波变换/","link":"","permalink":"http://ch206265.github.io/2019/06/05/从傅里叶变换到小波变换/","excerpt":"","text":"一般称在时间域内的离散数字信号为原始信号。大多数的信号都是这种基于时间的函数，其对应的图形也就是关于“时间-幅值”的图形。但是，仅有这一种描述形式还远远不够，因为信号的一些重要特征在时间域内并不能够有明显的体现。 如果想要在其他的变换域内表示信号，就必须对信号施加各种数学变换，傅里叶变换/小波变换等都是其中的一种。而任何经过某种数学变换的输出信号则被称为处理信号。 傅里叶变换FT傅里叶变换主要是将信号从时间域转换到频率域，信号的一些在时间域内表现的不明显的特征在频率域内会更加明显，更有利于对信号的分析。此外，傅里叶变换（包括小波变换）是一种可逆的数学变换，即它不仅能够将时间域内的信号转换到频率域（频率-幅值），还可以把频率域的信号转换回时间域（时间-幅值）。 但是，对于傅里叶变换在任何给定的时间，人们只能看到时间-幅值和频率-幅值二者之间的一种变化波形。也就是说： 观察时间域信号波形，看不出信号中的频率信息，只能看到信号的全部频率信息经过积分平均后所反映的信号在时刻t的值（可参考傅里叶逆变换公式$f(t)=\\int_{-\\infty}^{+\\infty} \\hat{f}(\\omega) \\mathrm{e}^{\\mathrm{i} 2 \\pi \\omega t} \\mathrm{d} \\omega$） 分析频率域（傅里叶变换域）信号的频谱波形则缺少时间信息，即，信号在某一频率处的值是全部时间域的信号值经过积分平均形成（可参考傅里叶变换公式$\\hat{f}(\\omega)=\\int_{-\\infty}^{+\\infty} f(t) \\mathrm{e}^{-\\mathrm{i} 2 \\pi \\omega t} \\mathrm{d} t$） 再次回顾一下傅里叶变换，它是将时间域的信号转换到了频率域，给出了信号的频谱，描述的是信号的“频率-幅值”波形。通过振幅值可以判断信号中存在多少频率成分（对应振幅值为0的频率成分不存在），发现信号在时间域中发现不了的特征。但是，傅里叶变换并没有告诉我们何种频率成分出现在何时。那么是不是在分析所有信号的时候都需要知道“何种频率成分出现在何时”呢？ 首先，平稳信号。在时间域中，我们称频率成分不随时间变化的信号为平稳信号。对于平稳信号，人们不需要知道其某一频率成分在什么时候出现。因为它的所有频率成分不随时间变化，在所有时刻都是一样的，也即平稳信号的所有频率成分在所有时刻出现。但是，对于非平稳信号，它的频率成分是随时间变化的，人们需要分析其频率和时间的关系也就需要同时知道它的时间和频率信息。这样，使用傅里叶变换分析非平稳信号就不太合适了。 短时傅里叶变换STFT非平稳信号在任一较短的时间间隔内可以近似认为是平稳信号，由此可以想象如果将非平稳信号切分成较短的时间区间，或用一个窗口长度较小的限制函数对原始非平稳信号加以限制，就可以形成一个近似的局部平稳信号，然后就可以在局部使用傅里叶变换进行分析。 这种通过取较短时间间隔或者加窗进行傅里叶变换的方法称为短时傅里叶变换（short time Fourier transform,STFT）又叫做窗口傅里叶变换(windowed Fourier transform,WFT)。所以，信号的短时傅里叶变换不是别的，正是这个信号和窗口函数相乘后的傅里叶变换。 S T F T_{f}(b, \\omega)=\\int_{-\\infty}^{+\\infty}[f(t) g(t-b)] \\cdot \\mathrm{e}^{-\\mathrm{i} 2 \\pi \\omega t} \\mathrm{d} t但是，短时傅里叶变换也具有局限性，且与其窗口函数有关。海森伯测不准原理说明，窗口函数的分辨率单元不可能在时间维和频率维同时达到无限小，即不可能得到信号的时频精确表示，也就是说，人们不可能知道哪一频率成分发生在哪一精确时刻，只能够知道某一披绿范围（即频带）发生在哪个时间间隔。 为了满足平稳性的假设，就必须有足够短的窗口函数，在这个较短的时间间隔内，信号才可以近似认为是平稳的。但是，窗口函数的时间域支撑越短，越适合平稳性假设，也就能获得越好的时间粉笔那缕，但是频率分辨率就越差；而宽的窗口给出了较好的频率分辨率但是时间分辨率变差，并且较宽的窗口也不满足平稳性要求。所以窗口函数的选择问题突出体现了短时傅里叶的变换的局限性 一般来说，实验中观测道德信号，其特定频率成分事先是不知道的，因此，利用短时傅里叶变换对信号进行有效分解时，也不能保证选择到恰当的窗口大小尺寸。 为了解决分析处理非平稳信号时遇到的这种分辨率选择，也即分析确定窗口函数宽度的问题，研究人员需要寻找其他更适合的技术，小波变换就是其中之一。 一个短时傅里叶变换的例子信号$f(t)$的表达式如下： f(t)=\\left\\{\\begin{array}{ll}{\\sin 2 \\pi \\cdot 300 t,} & {t \\in[0,250]} \\\\ {\\sin 2 \\pi \\cdot 200 t,} & {t \\in[250,500]} \\\\ {\\sin 2 \\pi \\cdot 100 t,} & {t \\in[500,750]} \\\\ {\\sin 2 \\pi \\cdot 50 t,} & {t \\in[750,1000]}\\end{array}\\right.很明显它是一个非平稳信号，并且它的时间域图像如下： 下图是该信号在在不同窗口下进行短时傅里叶变换的三维图： 从这三组图中可以看出 (a)图的窗口函数最窄，时间分辨率最高（时间轴上对应的窗口宽度最窄），但是频率分辨率较差（频率轴上对应的窗口宽度最宽） (b)和(c)图的窗口函数宽度逐渐变大，时间轴上对应的每一个分析窗口也越来越大，但是相应的，在频率轴上对应的分析窗口的宽度却越来越窄 这说明了短时傅里叶变换的窗口分辨率所潜在的问题，即，窗口函数的分辨率不能在时间维和频率维上同时达到最大。 小波变换WT小波变换的定义如下： W T_{f}(a, \\tau)=\\frac{1}{\\sqrt{a}} \\int_{R} f(t) \\psi^{*}\\left(\\frac{t-\\tau}{a}\\right) d t 其中$\\tau$代表平移参数，它表示尺度化后的基本小波沿时间轴移动的中心位置 $a&gt;0$，表示尺度参数，大的尺度对应着信号大范围内的整体概貌，对应较粗的观测；小的尺度则对应局部细节的观测 在短时傅里叶变换中，一旦选定了窗口函数，那么它就有了确定的窗口宽度或支撑。这样，短时傅里叶变换就只能用这单一不变的窗口分辨率去分析信号中的所有频率成分。 小波变换是短时傅里叶变换的发展，它能够针对待分析信号不同的频率成分调整窗口函数的宽度，即能够选择不同的分辨率对不同频率成分进行分析。比如： 在分析信号中的低频成分时，采用较低的时间分辨率（即窗口函数具有较大的时间域窗口宽度）。因为低的频率（大的尺度）对应的信号波形在时间域变化较缓而且持续时间长，用较宽的时间窗口就可以区分不同的频率成分。并且，宽的窗口函数对信号低频信息所能观察的范围更大/采集的样本更多，能更好地把握信号的整体性概貌或整体趋势 在分析高频成分时，采用较高的时间分辨率（即窗口具有较小的时间域窗口宽度）。因为高的频率（小的尺度）对应着信号的细节信息，对应的信号波形在时间域变化较快而且持续时间短，用窄窗口函数才可以区分不同的频率成分。并且，宅窗口有利于在时间域准确定位高频成分发生的时刻瞬间，从而预测信号的剧烈变化","categories":[{"name":"图像处理","slug":"图像处理","permalink":"http://ch206265.github.io/categories/图像处理/"}],"tags":[{"name":"小波变换","slug":"小波变换","permalink":"http://ch206265.github.io/tags/小波变换/"},{"name":"图形处理","slug":"图形处理","permalink":"http://ch206265.github.io/tags/图形处理/"}]}]}